[
  {
    "id": "comp-sekim",
    "companyId": "80ec2cbc-295e-4f4d-ba55-dd0064451a43",
    "name": "SEKIM International",
    "domain": "sekiminternational.com",
    "logo": "/logos/sekim.png",
    "rating": 4.9,
    "reviewCount": 3,
    "location": "Asia",
    "website": "https://sekim-international.com",
    "email": "info@sekiminternational.com",
    "phone": "+1 555-0123",
    "about": "At SEKIM International, we help small and medium-sized enterprises (SMEs) and start-ups to achieve successful international expansion through proven strategies and hands-on execution.",
    "description": "<h2>About the Company</h2>\n<p>At SEKIM International, we help small and medium-sized enterprises (SMEs) and start-ups to achieve successful international expansion through proven strategies and hands-on execution. We work directly with executives and frontline teams to navigate the complexities of global markets, transforming international growth from a daunting challenge into a structured pathway to success.</p>\n\n<h2>Our Value-Driven Approach</h2>\n\n<h3>Strategic Planning & Market Intelligence</h3>\n<p>We collaborate with you to develop clear, actionable international growth strategies that align with your business objectives. Our process includes comprehensive market analysis, capability gap assessment, and strategic prioritization of markets that offer the highest growth potential for your specific business model.</p>\n\n<h3>Execution Excellence & Implementation Support</h3>\n<p>Strategy without execution is merely planning. We actively partner with you to implement your expansion plans, providing access to in-market business development teams to ensure your international initiatives deliver measurable results. Our team works alongside yours to overcome operational challenges and accelerate market entry.</p>\n\n<h2>Why SEKIM International?</h2>\n\n<h3>Practical, Action-Oriented Solutions</h3>\n<p>We understand that SMEs and start-ups require practical, implementable strategies rather than theoretical frameworks. Our approach focuses on identifying, prioritizing, and executing commercial opportunities.</p>\n\n<h3>Proven Track Record Generating Results</h3>\n<p>Our methodology is built on delivering tangible business outcomes. We help you capitalize on international opportunities through structured processes that reduce risk while maximizing growth potential and export revenue.</p>\n\n<h3>Tailored Expertise for Growing Businesses</h3>\n<p>Unlike generic consulting firms, we specialize exclusively in the unique challenges and opportunities facing SMEs and start-ups in international markets. Our solutions are designed to maximize your international reach within your resource constraints.</p>\n\n<h2>Ready to Expand Globally?</h2>\n<p>If you're ready to expand your international footprint or accelerate export sales, we're here to help you achieve your growth objectives with confidence and clarity.</p>",
    "ratingBreakdown": {
      "serviceQuality": "5.0",
      "communication": "4.9",
      "delivery": "4.8",
      "valueForMoney": "4.9",
      "recommendation": "4.9"
    },
    "reviews": [
      {
        "id": "rev-sekim-001",
        "user": "Koldo Iturriagagoitia",
        "rating": 5,
        "title": "Regular Partner with Excellent Results",
        "content": "Eckoing has been a regular partner of SEKIM International several years. Whenever we have a project in Asia we count on them for their experience, their professionalism, and the confidence that the work will be well done. And our clients are delighted!",
        "date": "2024-11-15T10:30:00.000Z",
        "verified": true
      },
      {
        "id": "rev-sekim-002",
        "user": "Daniele Menin",
        "rating": 5,
        "title": "Hard Work and Professionalism",
        "content": "We have been working with SEKIM since 2019 and thanks to their hard work, professionalism and determination; we have been able to position our products at premium customers in many ASEAN countries.",
        "date": "2024-10-28T14:20:00.000Z",
        "verified": true
      },
      {
        "id": "rev-sekim-003",
        "user": "Iker Yeregui",
        "rating": 5,
        "title": "Outstanding Experience in Asia",
        "content": "An outstanding experience with our partner SEKIM in Asia. The team demonstrated deep knowledge of the local market, exceptional professionalism, and a client-focused approach. Their strategic insights helped us make confident, well-informed decisions. Highly recommended for anyone looking to grow in the region!",
        "date": "2024-09-10T09:45:00.000Z",
        "verified": true
      }
    ]
  }
]